Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: Their research project gave a total of 190 children, ages four to six, permission to tell them exactly how they experience kindergarten.
nb: I deres forskningsprosjekt fi kk i alt 190 barn fra fi re til seks år lov til å si sin hjertens mening om hvordan de opplever hverdagen i barnehagen.

source: Theory of culture and communication
nb: Kultur- og kommunikasjonsteori

source: carry out routine measurements of relevant environmental parameters and assess the results based on the species’ environmental requirements and tolerance limits
nb: utføre rutinemessige målinger av aktuelle miljøparametere og vurdere resultatene ut fra artens miljøkrav og toleransegrenser

source: There are many rules in kindergartens, and they are generally in place for the adults.
nb: Det er mange regler i barnehagen, og de er stort sett til for de voksne.

source: In addition, it means explaining and describing processes and products for customers, the authorities and others.
nb: Videre vil det si å forklare og beskrive prosesser og produkter for kunder, myndigheter og andre.

source: present different forms of expression from art and music related to Hinduism
nb: presentere ulike uttrykk fra kunst og musikk knyttet til hinduismen

source: Arguing for one's own assessments and giving constructive feedback is important in the natural science subject.
nb: Å argumentere for egne vurderinger og gi konstruktive tilbakemeldinger er viktig i naturfag.

source: Edvard is looking forward to being able to go in soon to eat and rest.
nb: Edvard gleder seg til han snart skal inn for å spise og hvile.

source: Figure 2.7 Students’ views on the frequency of different working methods used in mathematics lessons (3MX in Norway).
nb: Figur 2.7 Elevenes syn på hvor ofte ulike arbeidsmåter benyttes i matematikktimene (3MX i Norge).

source: “There is more time for talking, chatting and comfort, and it’s easier to observe the children who have problems.
nb: – Det blir mer tid til samtaler, prat og trøst, og det blir lettere å se de barna som har problemer.

source: Competence aims and assessment year 9
nb: Kompetansemål og vurdering 9. trinn

source: In addition, the main subject area covers key concepts such as polynomials, polynomial division and rational, logarithmic and exponential expressions.
nb: I tillegg omfatter hovedområdet sentrale begreper som polynomer, polynomdivisjon og rasjonale uttrykk, logaritmeuttrykk og eksponentialuttrykk.

source: develop, use and converse about varied counting strategies for addition and subtraction of double-digit numbers, and evaluate how reasonable the answer is
nb: utvikle, bruke og samtale om varierte regnestrategier for addisjon og subtraksjon av tosifrete tall og vurdere hvor rimelige svarene er

source: assess the use of aesthetic techniques in various media
nb: vurdere egen utvikling i produksjon av tegnspråktekster

source: read and understand the main points in texts about familiar topics
nb: lese og forstå hovedinnholdet i tekster om kjente emner

source: ✹ facilitate for pupil participation and enable pupils and apprentices/trainees
nb: ✹ legge til rette for elevmedvirkning og for at elevene og lærlingene/

source: There should be room for differences.
nb: Det skal være rom for variasjoner.

source: It also involves source criticism and the assessment of ethical questions related to personal security and copyright when working with one’s own texts.
nb: Det betyr også å utøve kildekritikk og vurdere etiske spørsmål knyttet til personvern og opphavsrett i arbeidet med egne tekster.

source: This includes describing observations and experiences from nature and the laboratory in the terminology of chemistry.
nb: I dette inngår å beskrive egne observasjoner og erfaringer fra naturen og laboratoriet ved å bruke kjemifaglige begreper.

source: This main subject area provides an overview of the location and extent of natural and man-made conditions on earth.
nb: Hovedområdet gir oversikt over lokalisering og utbredelse av naturlige og menneskeskapte forhold på jorda.

source: It also focuses on indigenous peoples, ethnic and national minorities and how xenophobia and racism can be counteracted, and who and what influence the lives of young people in our society.
nb: Det handler også om likestilling, urfolk, etniske og nasjonale minoriteter, hvordan fremmedfrykt og rasisme kan motarbeides, og hvem og hva som påvirker ungdom i dag.

source: in History and philosophy involves interpreting and creating tables and other forms of statistical material, and evaluating quantitative historic data.
nb: i historie og filosofi innebærer å tolke og å utforme tabeller og andre former for statistiske framstillinger og vurdere kvantitative historiske data.

source: understand and make use of numbers in practical situations
nb: forstå og bruke tall i praktiske situasjoner

source: In the subject of Mathematics the basic skills are understood as follows:
nb: I matematikk forstås grunnleggende ferdigheter slik:

source: Although, according to Swedish researcher Eva Marianne Johansson, conflicts are important for children.
nb: Men konflikter er viktige for barna, mener den svenske forskeren Eva Marianne Johansson.

source: At both lower and upper secondary levels, the criteria should be secondary level 1) took a mapping test in mathematics.
nb: I sluttrapporten fra følgeevalueringen fra Universitetet i Oslo (vedlegg 1) presenteresfunn knyttet til læreres, skolelederes og skoleeieres erfaringer med utvikling og bruk avkjennetegn på måloppnåelse som del av vurderingsarbeidet.

source: complete an exploratory in-depth project of their choice on a linguistic or literary topic and select communication methods appropriate to the project
nb: gjennomføre arbeidet med en selvvalgt fordypningsoppgave knyttet til historie og kultur og utforme den som en tegnspråktekst

source: starting points and various intervals, and describing patterns in the counting
nb: startpunkter og ulik differanse og beskrive mønstre i tellingene

source: In this chapter, England and Scotland are used as examples of
nb: I dette kapittelet er England og Skottland nytta som døme på

source: explain the Christian manner of measuring historic time and the events of the Christian church year, and describe Christian holidays, festivals and central rituals
nb: beskrive kirkebygget og andre kristne gudshus og reflektere over deres betydning og bruk, og nytte digitale verktøy til å søke informasjon og lage presentasjoner

source: The development of writing in art and crafts progresses from being able to put together texts, signs and symbols to being able to increase the readability of the texts, adjust texts to the purpose, and to make creative juxtapositions with visual instruments.
nb: Utviklingen av å kunne skrive i kunst og håndverk går fra å kunne sette sammen tekst, tegn og symboler til å kunne øke lesbarhet, tilpasse tekst til formålet og gjøre kreative sammenstillinger av visuelle virkemidler.

source: Overview of the main subject areas:
nb: Instruksjon og ledelse:

source: ‘By engaging with nature, the environment and technology, kindergartens shall enable the children to (…) build constructions from different materials and explore the opportunities offered by tools and technology’, states the Framework Plan in respect of technology.
nb: «Gjennom arbeid med natur, miljø og teknologi skal barnehagen bidra til at barna (…) lager konstruksjoner av ulike materialer og utforsker muligheter som ligger i redskaper og teknologi», står det om teknologi i planen.

source: It also deals with globalisation, distribution of wealth and resources and sustainable development, and about Norway’s role as an operator on the international stage.
nb: Det handler også om globalisering, fordeling av ressurser og bærekraftig utvikling, og Norges rolle som internasjonal aktør.

source: use factors, powers, square roots and prime numbers in calculations
nb: bruke faktorer, potenser, kvadratrøtter og primtall i beregninger

source: But to let every child participate and make choices when so many children are present is difficult,” Brit Johanne Eide says.
nb: Men det er ikke så lett å la mange medvirke og ta sine egne valg når det er så mange til stede, mener Brit Johanne Eide.

source: The programme subject covers work processes and vocational practice related to the operation and maintenance of an aquaculture facility.
nb: Programfaget omfatter arbeidsprosesser og yrkesutøvelse knyttet til drift og vedlikehold av akvakulturanlegg.

source: Teaching in the subjects shall provide an environment in which the pupil can develop practical skills, an understanding and general way of thinking in connection with commercial enterprise, vocational practice and nature.
nb: Opplæringen skal legge til rette for at eleven kan utvikle praktiske ferdigheter, forståelse og helhetstenkning i tilknytning til næring, yrkesutøvelse og natur.

source: Jarek, 4,5 years old, enters a playground and heads for two girls (Jasia 3,5 years, and Natia 4 years); all of them share the same primary language.
nb: Jarek (4,5 år) går opp i ei sandkasse og bort til to jenter (Jasia 3,5 år og Natia 4 år) som har samme førstespråk som han selv.

source: International English: 140 teaching hours per year
nb: Internasjonal engelsk: 140 årstimer

source: Staff members at ECEC institutions find it hard to accept that it is so difficult to access special education expertise.
nb: Personalet i barnehagen opplever det som problematisk at den spesialpedagogiske hjelpen er så lite tilgjengelig.

source: Religions and philosophies of life reflect humanity's deepest questions, and have throughout history contributed to moulding individuals, communities and society.
nb: Religioner og livssyn gjenspeiler menneskers dypeste spørsmål og har gjennom historien bidratt til å forme individ, fellesskap og samfunn.

source: Many children are involved in pressing and straining the apple juice and carrying the clay – or rather the apples – back and forth with tractors, tricycles and trucks.
nb: Mange barn er involvert i å presse og sile eplesaft og frakte leiren – eller eplene – fram og tilbake med traktorer, sykler og lastebiler.

source: discuss cross-cultural encounters and cultural conflicts on the basis of selected contemporary texts
nb: drøfte kulturmøter og kulturkonflikter med utgangspunkt i et utvalg samtidstekster

source: find words and phrases that are common to English and the native language
nb: finne ord og uttrykk som er felles for morsmålet og engelsk

source: in the development of identity and ethical, social and cultural competence, and in the ability to understand democracy and democratic participation
nb: utvikling og identitet, i det å utvikle etisk, sosial og kulturell kompetanse og evne til demokratiforståelse og demokratisk deltakelse

source: give an account of the concepts of statistical independence and conditional probability, and derive and apply Bayes' equation for two events
nb: gjøre rede for begrepene uavhengighet og betinget sannsynlighet, og utlede og anvende Bayes' setning på to hendelser

source: What actually happens at naptime?
nb: Hva skjer egentlig i hvilestunden?

source: locate and present information about themes from the social sciences from suitable sources – including digital sources - and evaluate information that is useful and credible
nb: finne og presentere informasjon om samfunnsfaglige tema fra tilrettelagte kilder, også digitale, og vurdere om informasjonen er nyttig og pålitelig

source: numbers on the number line, and assess and name the amounts
nb: tallinjen og vurdere og navngi størrelsene

source: explore and generalise the multiplication of polynomials algebraically
nb: utforske og generalisere multiplikasjon av polynomer algebraisk og

source: They absolutely love being outside here.
nb: De liker godt å være her ute, forteller de.

source: Solid competence in mathematics involves using problem-solving techniques and modelling to analyse and transform a problem into mathematic form, solve the problem and evaluate the validity of the solution.
nb: Matematisk kompetanse innebærer å bruke problemløsning og modellering til å analysere og omforme et problem til matematisk form, løse det og vurdere gyldigheten av løsningen.

source: Support and guidance
nb: Støtte og veiledning

source: use the concepts past, present and future in relation to oneself and one’s own family
nb: bruke begrepene fortid, nåtid og framtid om seg selv og familien

source: The development of oral skills in art and crafts progresses from being able to talk about one's own observations and experiences to being able to describe visual instruments, crafts, and art and historical cultural references.
nb: Utviklingen av muntlige ferdigheter i kunst og håndverk går fra å kunne fortelle om egne observasjoner og opplevelser til å kunne beskrive visuelle virkemidler, håndverk og kunst- og kulturhistoriske referanser.

source: Curriculum for the elective subject of Research in Practice (FIP1-01)
nb: Læreplan i valgfaget forskning i praksis (FIP1-01)

source: She has also interviewed kindergarten teachers and assistants about outdoor physical activities in kindergartens.
nb: I tillegg har hun intervjuet barnehagelærere og assistenter om fysiske utendørsaktiviteter i barnehagen.

source: interval from 0 to 8π corresponds to 4 periods of the sine and cosine functions.
nb: Intervallet fra 0 til 8π tilsvarer 4 perioder av sinus- og cosinusfunksjonene.

source: listen to and recognise some common slang and youth language
nb: lytte til og gjenkjenne en del alminnelige slanguttrykk og ungdomsspråk

source: The main subject area deals with the use of probability theory to describe and analyze random variations and systematic trends in a number of practical situations.
nb: Hovedområdet handler om sannsynlighetsregning som gjør det mulig å beskrive og analysere tilfeldige variasjoner og systematiske tendenser i en rekke praktiske situasjoner.

source: They can also reconstruct memories.
nb: De kan også gjenskape minner.

source: “The staff uses these tools both because they have to and sometimes because they find them useful.”
nb: – De ansatte i barnehagen ­bruker disse verktøyene, noen ganger fordi de må og andre ganger fordi verk­tøyene oppleves som nyttige.

source: For schools, this is done by classifying measures in a traffic light model with green, yellow and red levels.
nb: Instrumenter og musikkutstyr bør så langt det er mulig ikke deles og ikke berøres av andre enn den som skal benytte det.

source: in Aquaculture involves producing and presenting calculations and processed information digitally.
nb: i akvakultur innebærer å formidle og presentere, kalkulere og bearbeide informasjon digitalt.

source: Dyslexia in English as a Second Language.
nb: hva sektorens yrkesgrupper og profesjoner har å si for reformgjennomføringen.

source: Reading for the purpose of information retrieval and reading source text in a critical manner to find information from simple, suitable sources and to evaluate such information is a very useful skill.
nb: Lesing for informasjonsinnhenting og kritisk lesing av kilder begynner med å finne informasjon i enkle, tilrettelagte kilder og å vurdere om informasjonen er nyttig.

source: present and discuss current events and interdisciplinary topics
nb: presentere og samtale om aktuelle og tverrfaglige temaer

source: use various hand and electric tools to treat and join hard, plastic and
nb: bruke ulike håndverktøy og elektriske verktøy for å bearbeide og

source: understand and interpret information from different forms of expression in a composite text
nb: eksperimentere med ulike tegnspråklige virkemidler og stilvarianter

source: The head teacher in the kindergarten, Hanne Kolnes Williams tells us the secret.
nb: Daglig leder Hanne Kolnes Williams forteller oss hemmeligheten.

source: calculate with infinite geometric series with a constant and variable quotients, determine the area of convergence for these series and present the results
nb: regne med uendelige geometriske rekker med konstante og variable kvotienter, bestemme konvergensområdet for disse rekkene og presentere resultatene

source: listen to, evaluate and provide constructive feedback on oral presentations given by others in Norwegian or Sign Language
nb: lytte til, vurdere og gi veiledende tilbakemelding på andres muntlige presentasjoner på norsk eller tegnspråk

source: The main subject area deals with knowledge of the English language and with various strategies for promoting personal language learning.
nb: Hovedområdet dreier seg om kunnskap om det engelske språket og ulike strategier for å fremme egen språklæring.

source: make estimates of and calculate length, circumference, angle, area, surface, volume and time, and use and change scales
nb: gjøre overslag over og beregne lengde, omkrets, vinkel, areal, overflate, volum, tid, fart og massetetthet, og bruke og endre målestokk

source: Through encounters with art and culture, and work on visual expression, the pupils develop the ability to interpret, participate and change the society in which they live.
nb: Gjennom møter med kunst og kultur og arbeid med visuelle ytringer kan elevene utvikle evne til å tolke, medvirke i og endre samfunnet de lever i.

source: explain results from experiments with electrical circuits using terms such as current, voltage, resistance, output and induction
nb: forklare resultater fra forsøk med strømkretser ved bruk av begrepene strøm, spenning, resistans, effekt og induksjon

source: This can lay the basis for reflection, emotions and spontaneity.
nb: Dette kan gi grunnlag for refleksjon, følelser og spontanitet.

source: It also involves using work-relevant digital tools and instruments.
nb: Det innebærer også å bruke yrkesrelevante digitale verktøy og instrumenter.

source: converse with and pose questions to their fellow pupils about technical topics and everyday events
nb: samtale med og stille spørsmål til medelever om faglige emner og hendelser i hverdagen

source: read different types of texts in Bokmål and Nynorsk with fluency and comprehension
nb: trekke slutninger på grunnlag av forståelse for sammenheng mellom deler og helhet i tekster

source: The pupils also demonstrate and develop competence when using different representations and strategies to explore relationships when working with patterns, geometric figures and decimal numbers.
nb: Elevene viser og utvikler også kompetanse når de bruker ulike representasjoner og strategier for å utforske sammenhenger i arbeid med mønstre, geometriske figurer og desimaltall.

source: of religion focuses on the extent of religions and views on life globally, nationally and locally.
nb: handler om utbredelsen av religioner og livssyn både globalt, nasjonalt og lokalt.

source: present technical information using relevant specialist terminology and appropriate digital tools and media adapted to different recipients
nb: presentere fagstoff med relevant fagterminologi og formålstjenlig bruk av digitale verktøy og medier, tilpasset ulike mottakere

source: As early as in 1983, the city’s Sámi Society recognized the need for a separate Sámi kindergarten, so they organised a private one.
nb: Men allerede i 1983 så den samiske foreningen i byen behovet for en egen samisk barnehage og etablerte en privat barnehage.

source: The grade awarded for coursework shall reflect the overall competence of the pupil in Social Studies after completing year 10.
nb: Standpunktkarakteren skal være uttrykk for den samlede kompetansen eleven har i samfunnsfag ved avslutningen av opplæringen etter 10.

source: create and illustrate stories about humans living under different conditions and compare their ways of living
nb: skape og illustrere fortellinger om mennesker som lever under ulike vilkår, og sammenlikne livsvilkår

source: draw graphs of polynomial functions, exponential functions, power functions and rational functions with linear numerators and denominators with and without digital means
nb: tegne grafen til polynomfunksjoner, eksponentialfunksjoner, potensfunksjoner og rasjonale funksjoner med lineær teller og nevner, både med og uten digitale hjelpemidler

source: Social economics 2
nb: Samfunnsøkonomi 2 Hovedområdet

source: For example, there were slightly more children who responded that kindergarten is fun, than those who found it boring.
nb: For eksempel var det litt flere barn som svarte at det var morsomt i barnehagen, enn det var barn som mente at det var kjedelig der.

source: The only subject where Norwegian teachers are clearly above the international average is the use of ICT in mathematics.
nb: Det eneste emnet hvor norske lærere ligger klart over det internasjonale gjennomsnittet, er bruk av IKT i matematikk.

source: develop and use varied methods of multiplication and division, use these in practical situations and use the standard multiplication table counting in one’s head and for solving equations
nb: utvikle og bruke varierte metoder for multiplikasjon og divisjon, bruke dem i praktiske situasjoner og bruke den lille multiplikasjonstabellen i hoderegning og i oppgaveløsning

source: understand and use numbers in practical situations
nb: forstå og bruke tall i praktiske situasjoner

source: Such processes are nevertheless not without problems.
nb: Slike prosesser er likevel ikke uproblematiske.

source: Working in the subject will make it easier for pupils to understand the value of and challenges to technology and entrepreneurship, and they will develop knowledge about working life and global and national economics and personal economy.
nb: Gjennom arbeid med faget vil elevene lettere forstå verdien av og utfordringer knyttet til teknologi og entreprenørskap, og de vil utvikle kunnskap om arbeidsliv og global, nasjonal og personlig økonomi.

source: On a scale ranging from 1 (very seldom) to 6 (very often), a majority of the head teachers chose the two lowest values.
nb: På en skala fra 1 (svært sjelden) til 6 (svært ofte) krysset et flertall av styrerne av for en av de to laveste verdiene.

source: in the natural science subject means presenting and describing one's own experiences and observations from nature.
nb: i naturfag innebærer å presentere og beskrive egne opplevelser og observasjoner fra naturen.

source: ‘It was obvious to the researchers that entrepreneurial learning was interpreted very differently at the various institutions’, comments Anna Ehrlin.
nb: Det ble veldig tydelig for forskerne at entreprenøriell læring ble tolket svært forskjellig ved de ulike institusjonene, forteller Anna Ehrlin.

source: The pupils further demonstrate and develop their competence when they show their ability to interact digitally, recognise and use rules concerning data protection and copyright, and show that they can judge digital sources.
nb: Videre viser og utvikler de kompetanse når de samhandler digitalt, kjenner til og bruker regler for personvern og opphavsrett, og viser digital dømmekraft.

source: use letters and experiment with writing English words and expressions
nb: bruke bokstaver og eksperimentere med å skrive engelske ord og uttrykk

source: present a selection of translated and original Nordic texts
nb: gjøre rede for språkslektskap og fellestrekk i sentrale auditive og i sentrale visuelle språk

source: Overall, the boys are more physically active than the girls during the day, especially while in preschool’, Olesen states.
nb: Guttene er mer fysisk aktive enn jentene totalt sett i løpet av dagen, og særlig i den tiden de er i barnehagen, forteller Olesen.

source: interpret and use historical data when working with history
nb: gjøre rede for hovedlinjer i demokratiets utvikling
